STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235axx_ca35.h
/********  Bit definition for CA35SYSCFG_TRACE_CLK_DIV_CR register  ********/
#define CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Pos      (0U)
#define CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Msk      (0x3FUL << CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Pos)        /*!< 0x0000003F */
#define CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE          CA35SYSCFG_TRACE_CLK_DIV_CR_TRACE_CLK_DIV_VALUE_Msk   /*!< 0x1 to 0x3F: Divider ratio from 2 to 64 */

/***********  Bit definition for CA35SYSCFG_DBGPWR_CR register  ************/
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Pos                       (0U)
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Msk                       (0x1UL << CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Pos)          /*!< 0x00000001 */
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP0                           CA35SYSCFG_DBGPWR_CR_DBGPWRUP0_Msk                    /*!<  */
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Pos                       (1U)
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Msk                       (0x1UL << CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Pos)          /*!< 0x00000002 */
#define CA35SYSCFG_DBGPWR_CR_DBGPWRUP1                           CA35SYSCFG_DBGPWR_CR_DBGPWRUP1_Msk                    /*!<  */

/*******  Bit definition for CA35SYSCFG_DBGL1RSTDISABLE_CR register  *******/
#define CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Pos            (0U)
#define CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Msk            (0x1UL << CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Pos) /*!< 0x00000001 */
#define CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS                CA35SYSCFG_DBGL1RSTDISABLE_CR_DBGL1RSTDIS_Msk         /*!<  */

/***********  Bit definition for CA35SYSCFG_DBGPWR_SR register  ************/
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Pos                    (0U)
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Pos)       /*!< 0x00000001 */
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0                        CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN0_Msk                 /*!<  */
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Pos                    (1U)
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Pos)       /*!< 0x00000002 */
#define CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1                        CA35SYSCFG_DBGPWR_SR_DBGNOPWRDWN1_Msk                 /*!<  */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Pos                    (2U)
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Pos)       /*!< 0x00000004 */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0                        CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ0_Msk                 /*!<  */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Pos                    (3U)
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Msk                    (0x1UL << CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Pos)       /*!< 0x00000008 */
#define CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1                        CA35SYSCFG_DBGPWR_SR_DBGPWRUPREQ1_Msk                 /*!<  */

/***********  Bit definition for CA35SYSCFG_EDBGACK_SR register  ***********/
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Pos                      (0U)
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Msk                      (0x1UL << CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Pos)         /*!< 0x00000001 */
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C0                          CA35SYSCFG_EDBGACK_SR_DBGACK_C0_Msk                   /*!<  */
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Pos                      (1U)
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Msk                      (0x1UL << CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Pos)         /*!< 0x00000002 */
#define CA35SYSCFG_EDBGACK_SR_DBGACK_C1                          CA35SYSCFG_EDBGACK_SR_DBGACK_C1_Msk                   /*!<  */

/************  Bit definition for CA35SYSCFG_GIC_CFGR register  ************/
#define CA35SYSCFG_GIC_CFGR_GIC_4KNOT64K_Pos                     (0U)
#define CA35SYSCFG_GIC_CFGR_GIC_4KNOT64K_Msk                     (0x1UL << CA35SYSCFG_GIC_CFGR_GIC_4KNOT64K_Pos)        /*!< 0x00000001 */
#define CA35SYSCFG_GIC_CFGR_GIC_4KNOT64K                         CA35SYSCFG_GIC_CFGR_GIC_4KNOT64K_Msk                  /*!<  */

/*************  Bit definition for CA35SYSCFG_LP_SR register  **************/
#define CA35SYSCFG_LP_SR_STANDBYWFE_0_Pos                        (0U)
#define CA35SYSCFG_LP_SR_STANDBYWFE_0_Msk                        (0x1UL << CA35SYSCFG_LP_SR_STANDBYWFE_0_Pos)           /*!< 0x00000001 */
#define CA35SYSCFG_LP_SR_STANDBYWFE_0                            CA35SYSCFG_LP_SR_STANDBYWFE_0_Msk                     /*!<  */
#define CA35SYSCFG_LP_SR_STANDBYWFE_1_Pos                        (1U)
#define CA35SYSCFG_LP_SR_STANDBYWFE_1_Msk                        (0x1UL << CA35SYSCFG_LP_SR_STANDBYWFE_1_Pos)           /*!< 0x00000002 */
#define CA35SYSCFG_LP_SR_STANDBYWFE_1                            CA35SYSCFG_LP_SR_STANDBYWFE_1_Msk                     /*!<  */
#define CA35SYSCFG_LP_SR_STANDBYWFI_0_Pos                        (2U)
#define CA35SYSCFG_LP_SR_STANDBYWFI_0_Msk                        (0x1UL << CA35SYSCFG_LP_SR_STANDBYWFI_0_Pos)           /*!< 0x00000004 */
#define CA35SYSCFG_LP_SR_STANDBYWFI_0                            CA35SYSCFG_LP_SR_STANDBYWFI_0_Msk                     /*!<  */
#define CA35SYSCFG_LP_SR_STANDBYWFI_1_Pos                        (3U)
#define CA35SYSCFG_LP_SR_STANDBYWFI_1_Msk                        (0x1UL << CA35SYSCFG_LP_SR_STANDBYWFI_1_Pos)           /*!< 0x00000008 */
#define CA35SYSCFG_LP_SR_STANDBYWFI_1                            CA35SYSCFG_LP_SR_STANDBYWFI_1_Msk                     /*!<  */
#define CA35SYSCFG_LP_SR_STANDBYWFIL2_Pos                        (4U)
#define CA35SYSCFG_LP_SR_STANDBYWFIL2_Msk                        (0x1UL << CA35SYSCFG_LP_SR_STANDBYWFIL2_Pos)           /*!< 0x00000010 */
#define CA35SYSCFG_LP_SR_STANDBYWFIL2                            CA35SYSCFG_LP_SR_STANDBYWFIL2_Msk                     /*!<  */

/***********  Bit definition for CA35SYSCFG_RSTACK_SR register  ************/
#define CA35SYSCFG_RSTACK_SR_NRESET_DBG_ACK_Pos                  (0U)
#define CA35SYSCFG_RSTACK_SR_NRESET_DBG_ACK_Msk                  (0x1UL << CA35SYSCFG_RSTACK_SR_NRESET_DBG_ACK_Pos)     /*!< 0x00000001 */
#define CA35SYSCFG_RSTACK_SR_NRESET_DBG_ACK                      CA35SYSCFG_RSTACK_SR_NRESET_DBG_ACK_Msk               /*!<  */
#define CA35SYSCFG_RSTACK_SR_NRESET_FCT_ACK_Pos                  (1U)
#define CA35SYSCFG_RSTACK_SR_NRESET_FCT_ACK_Msk                  (0x1UL << CA35SYSCFG_RSTACK_SR_NRESET_FCT_ACK_Pos)     /*!< 0x00000002 */
#define CA35SYSCFG_RSTACK_SR_NRESET_FCT_ACK                      CA35SYSCFG_RSTACK_SR_NRESET_FCT_ACK_Msk               /*!<  */

/*********  Bit definition for CA35SYSCFG_AARCH_MODE_CR register  **********/
#define CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Pos                   (0U)
#define CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Msk                   (0x1UL << CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Pos)      /*!< 0x00000001 */
#define CA35SYSCFG_AARCH_MODE_CR_AA64NAA32                       CA35SYSCFG_AARCH_MODE_CR_AA64NAA32_Msk                /*!<  */

/************  Bit definition for CA35SYSCFG_VBAR_CR register  *************/
#define CA35SYSCFG_VBAR_CR_RVBARADDRL_Pos                        (2U)
#define CA35SYSCFG_VBAR_CR_RVBARADDRL_Msk                        (0x3FFFFFFFUL << CA35SYSCFG_VBAR_CR_RVBARADDRL_Pos)    /*!< 0xFFFFFFFC */
#define CA35SYSCFG_VBAR_CR_RVBARADDRL                            CA35SYSCFG_VBAR_CR_RVBARADDRL_Msk                     /*!< Set the value of reset vector at the boundaries of the Cortex-A35 cores */

/*********  Bit definition for CA35SYSCFG_M33_ACCESS_CR register  **********/
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Pos                  (0U)
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Msk                  (0x1UL << CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Pos)     /*!< 0x00000001 */
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC                      CA35SYSCFG_M33_ACCESS_CR_M33CFG_SEC_Msk               /*!<  */
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Pos                 (1U)
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Msk                 (0x1UL << CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Pos)    /*!< 0x00000002 */
#define CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV                     CA35SYSCFG_M33_ACCESS_CR_M33CFG_PRIV_Msk              /*!<  */

/**********  Bit definition for CA35SYSCFG_M33_TZEN_CR register  ***********/
#define CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Pos                    (0U)
#define CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Msk                    (0x1UL << CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Pos)       /*!< 0x00000001 */
#define CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT                        CA35SYSCFG_M33_TZEN_CR_CFG_SECEXT_Msk                 /*!<  */

/********  Bit definition for CA35SYSCFG_M33_INITSVTOR_CR register  ********/
#define CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Pos                (7U)
#define CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Msk                (0x1FFFFFFUL << CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Pos)   /*!< 0xFFFFFF80 */
#define CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR                    CA35SYSCFG_M33_INITSVTOR_CR_INITSVTOR_Msk             /*!< Secure vector table offset */

/*******  Bit definition for CA35SYSCFG_M33_INITNSVTOR_CR register  ********/
#define CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Pos              (7U)
#define CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Msk              (0x1FFFFFFUL << CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Pos)     /*!< 0xFFFFFF80 */
#define CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR                  CA35SYSCFG_M33_INITNSVTOR_CR_INITNSVTOR_Msk           /*!< Non-secure vector table offset */

/*************  Bit definition for CA35SYSCFG_VERR register  ***************/
#define CA35SYSCFG_VERR_MINREV_Pos                               (0U)
#define CA35SYSCFG_VERR_MINREV_Msk                               (0xFUL << CA35SYSCFG_VERR_MINREV_Pos)                  /*!< 0x0000000F */
#define CA35SYSCFG_VERR_MINREV                                   CA35SYSCFG_VERR_MINREV_Msk                            /*!< minor revision information */
#define CA35SYSCFG_VERR_MAJREV_Pos                               (4U)
#define CA35SYSCFG_VERR_MAJREV_Msk                               (0xFUL << CA35SYSCFG_VERR_MAJREV_Pos)                  /*!< 0x000000F0 */
#define CA35SYSCFG_VERR_MAJREV                                    CA35SYSCFG_VERR_MAJREV_Msk                           /*!< major revision information */

/*************  Bit definition for CA35SYSCFG_IPIDR register  **************/
#define CA35SYSCFG_IPIDR_ID_Pos                                  (0U)
#define CA35SYSCFG_IPIDR_ID_Msk                                  (0xFFFFFFFFUL << CA35SYSCFG_IPIDR_ID_Pos)              /*!< 0xFFFFFFFF */
#define CA35SYSCFG_IPIDR_ID                                      CA35SYSCFG_IPIDR_ID_Msk                               /*!< BSEC identification */

/*************  Bit definition for CA35SYSCFG_SIDR register  ***************/
#define CA35SYSCFG_SIDR_SID_Pos                                  (0U)
#define CA35SYSCFG_SIDR_SID_Msk                                  (0xFFFFFFFFUL << CA35SYSCFG_SIDR_SID_Pos)              /*!< 0xFFFFFFFF */
#define CA35SYSCFG_SIDR_SID                                      CA35SYSCFG_SIDR_SID_Msk                               /*!< BSEC size identification */

/******************************************************************************/
/*                                                                            */
/*                          CRC calculation unit                              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for CRC_DR register  *********************/
#define CRC_DR_DR_Pos            (0U)
#define CRC_DR_DR_Msk            (0xFFFFFFFFUL << CRC_DR_DR_Pos)                /*!< 0xFFFFFFFF */
#define CRC_DR_DR                CRC_DR_DR_Msk                                 /*!< Data register bits */

/*******************  Bit definition for CRC_IDR register  ********************/
#define CRC_IDR_IDR_Pos          (0U)
#define CRC_IDR_IDR_Msk          (0xFFFFFFFFUL << CRC_IDR_IDR_Pos)              /*!< 0xFFFFFFFF */
#define CRC_IDR_IDR              CRC_IDR_IDR_Msk                               /*!< General-purpose 32-bit data register bits */

/********************  Bit definition for CRC_CR register  ********************/
#define CRC_CR_RESET_Pos         (0U)
#define CRC_CR_RESET_Msk         (0x1UL << CRC_CR_RESET_Pos)                    /*!< 0x00000001 */
#define CRC_CR_RESET             CRC_CR_RESET_Msk                              /*!< RESET the CRC computation unit bit */
#define CRC_CR_POLYSIZE_Pos      (3U)
#define CRC_CR_POLYSIZE_Msk      (0x3UL << CRC_CR_POLYSIZE_Pos)                 /*!< 0x00000018 */
#define CRC_CR_POLYSIZE          CRC_CR_POLYSIZE_Msk                           /*!< Polynomial size bits */
#define CRC_CR_POLYSIZE_0        (0x1UL << CRC_CR_POLYSIZE_Pos)                 /*!< 0x00000008 */
#define CRC_CR_POLYSIZE_1        (0x2UL << CRC_CR_POLYSIZE_Pos)                 /*!< 0x00000010 */
#define CRC_CR_REV_IN_Pos        (5U)
#define CRC_CR_REV_IN_Msk        (0x3UL << CRC_CR_REV_IN_Pos)                   /*!< 0x00000060 */
#define CRC_CR_REV_IN            CRC_CR_REV_IN_Msk                             /*!< REV_IN Reverse Input Data bits */
#define CRC_CR_REV_IN_0          (0x1UL << CRC_CR_REV_IN_Pos)                   /*!< 0x00000020 */
#define CRC_CR_REV_IN_1          (0x2UL << CRC_CR_REV_IN_Pos)                   /*!< 0x00000040 */
#define CRC_CR_REV_OUT_Pos       (7U)
#define CRC_CR_REV_OUT_Msk       (0x1UL << CRC_CR_REV_OUT_Pos)                  /*!< 0x00000080 */
#define CRC_CR_REV_OUT           CRC_CR_REV_OUT_Msk                            /*!< REV_OUT Reverse Output Data bits */

/*******************  Bit definition for CRC_INIT register  *******************/
#define CRC_INIT_INIT_Pos        (0U)
#define CRC_INIT_INIT_Msk        (0xFFFFFFFFUL << CRC_INIT_INIT_Pos)            /*!< 0xFFFFFFFF */
#define CRC_INIT_INIT            CRC_INIT_INIT_Msk                             /*!< Initial CRC value bits */

/*******************  Bit definition for CRC_POL register  ********************/
#define CRC_POL_POL_Pos          (0U)
#define CRC_POL_POL_Msk          (0xFFFFFFFFUL << CRC_POL_POL_Pos)              /*!< 0xFFFFFFFF */
#define CRC_POL_POL              CRC_POL_POL_Msk                               /*!< Coefficients of the polynomial */

/******************************************************************************/
/*                                                                            */
/*                                    (CSI)                                   */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for CSI_CR register  ********************/
#define CSI_CR_CSIEN_Pos                (0U)
#define CSI_CR_CSIEN_Msk                (0x1UL << CSI_CR_CSIEN_Pos)               /*!< 0x00000001 */
#define CSI_CR_CSIEN                    CSI_CR_CSIEN_Msk                         /*!< CSI-2 enable */
#define CSI_CR_VC0START_Pos             (2U)
#define CSI_CR_VC0START_Msk             (0x1UL << CSI_CR_VC0START_Pos)            /*!< 0x00000004 */
#define CSI_CR_VC0START                 CSI_CR_VC0START_Msk                      /*!< Virtual channel 0 start */
#define CSI_CR_VC0STOP_Pos              (3U)
#define CSI_CR_VC0STOP_Msk              (0x1UL << CSI_CR_VC0STOP_Pos)             /*!< 0x00000008 */
#define CSI_CR_VC0STOP                  CSI_CR_VC0STOP_Msk                       /*!< Virtual channel 0 stop */
#define CSI_CR_VC1START_Pos             (6U)
#define CSI_CR_VC1START_Msk             (0x1UL << CSI_CR_VC1START_Pos)            /*!< 0x00000040 */
#define CSI_CR_VC1START                 CSI_CR_VC1START_Msk                      /*!< Virtual channel 1 start */
#define CSI_CR_VC1STOP_Pos              (7U)
#define CSI_CR_VC1STOP_Msk              (0x1UL << CSI_CR_VC1STOP_Pos)             /*!< 0x00000080 */
#define CSI_CR_VC1STOP                  CSI_CR_VC1STOP_Msk                       /*!< Virtual channel 1 stop */
#define CSI_CR_VC2START_Pos             (10U)
#define CSI_CR_VC2START_Msk             (0x1UL << CSI_CR_VC2START_Pos)            /*!< 0x00000400 */
#define CSI_CR_VC2START                 CSI_CR_VC2START_Msk                      /*!< Virtual channel 2 start */
#define CSI_CR_VC2STOP_Pos              (11U)
#define CSI_CR_VC2STOP_Msk              (0x1UL << CSI_CR_VC2STOP_Pos)             /*!< 0x00000800 */
#define CSI_CR_VC2STOP                  CSI_CR_VC2STOP_Msk                       /*!< Virtual channel 2 stop */
#define CSI_CR_VC3START_Pos             (14U)
#define CSI_CR_VC3START_Msk             (0x1UL << CSI_CR_VC3START_Pos)            /*!< 0x00004000 */
#define CSI_CR_VC3START                 CSI_CR_VC3START_Msk                      /*!< Virtual channel 3 start */
#define CSI_CR_VC3STOP_Pos              (15U)
#define CSI_CR_VC3STOP_Msk              (0x1UL << CSI_CR_VC3STOP_Pos)             /*!< 0x00008000 */
#define CSI_CR_VC3STOP                  CSI_CR_VC3STOP_Msk                       /*!< Virtual channel 3 stop */

/*******************  Bit definition for CSI_PCR register  ********************/
#define CSI_PCR_PWRDOWN_Pos             (0U)
#define CSI_PCR_PWRDOWN_Msk             (0x1UL << CSI_PCR_PWRDOWN_Pos)            /*!< 0x00000001 */
#define CSI_PCR_PWRDOWN                 CSI_PCR_PWRDOWN_Msk                      /*!< Virtual channel 3 start */
#define CSI_PCR_CLEN_Pos                (1U)
#define CSI_PCR_CLEN_Msk                (0x1UL << CSI_PCR_CLEN_Pos)               /*!< 0x00000002 */
#define CSI_PCR_CLEN                    CSI_PCR_CLEN_Msk                         /*!< Clock lane enable */
#define CSI_PCR_DL0EN_Pos               (2U)
#define CSI_PCR_DL0EN_Msk               (0x1UL << CSI_PCR_DL0EN_Pos)              /*!< 0x00000004 */
#define CSI_PCR_DL0EN                   CSI_PCR_DL0EN_Msk                        /*!< D-PHY_RX data lane 0 enable */
#define CSI_PCR_DL1EN_Pos               (3U)
#define CSI_PCR_DL1EN_Msk               (0x1UL << CSI_PCR_DL1EN_Pos)              /*!< 0x00000008 */
#define CSI_PCR_DL1EN                   CSI_PCR_DL1EN_Msk                        /*!< D-PHY_RX data lane 1 enable */

/*****************  Bit definition for CSI_VC0CFGR1 register  *****************/
#define CSI_VC0CFGR1_ALLDT_Pos          (0U)
#define CSI_VC0CFGR1_ALLDT_Msk          (0x1UL << CSI_VC0CFGR1_ALLDT_Pos)         /*!< 0x00000001 */
#define CSI_VC0CFGR1_ALLDT              CSI_VC0CFGR1_ALLDT_Msk                   /*!< All data types enable for the virtual channel x */
#define CSI_VC0CFGR1_DT0EN_Pos          (1U)
#define CSI_VC0CFGR1_DT0EN_Msk          (0x1UL << CSI_VC0CFGR1_DT0EN_Pos)         /*!< 0x00000002 */
#define CSI_VC0CFGR1_DT0EN              CSI_VC0CFGR1_DT0EN_Msk                   /*!< Data type 0 enable */
#define CSI_VC0CFGR1_DT1EN_Pos          (2U)
#define CSI_VC0CFGR1_DT1EN_Msk          (0x1UL << CSI_VC0CFGR1_DT1EN_Pos)         /*!< 0x00000004 */
#define CSI_VC0CFGR1_DT1EN              CSI_VC0CFGR1_DT1EN_Msk                   /*!< Data type 1 enable */
#define CSI_VC0CFGR1_DT2EN_Pos          (3U)
#define CSI_VC0CFGR1_DT2EN_Msk          (0x1UL << CSI_VC0CFGR1_DT2EN_Pos)         /*!< 0x00000008 */
#define CSI_VC0CFGR1_DT2EN              CSI_VC0CFGR1_DT2EN_Msk                   /*!< Data type 2 enable */
#define CSI_VC0CFGR1_DT3EN_Pos          (4U)
#define CSI_VC0CFGR1_DT3EN_Msk          (0x1UL << CSI_VC0CFGR1_DT3EN_Pos)         /*!< 0x00000010 */
#define CSI_VC0CFGR1_DT3EN              CSI_VC0CFGR1_DT3EN_Msk                   /*!< Data type 3 enable */
#define CSI_VC0CFGR1_DT4EN_Pos          (5U)
#define CSI_VC0CFGR1_DT4EN_Msk          (0x1UL << CSI_VC0CFGR1_DT4EN_Pos)         /*!< 0x00000020 */
#define CSI_VC0CFGR1_DT4EN              CSI_VC0CFGR1_DT4EN_Msk                   /*!< Data type 4 enable */
#define CSI_VC0CFGR1_DT5EN_Pos          (6U)
#define CSI_VC0CFGR1_DT5EN_Msk          (0x1UL << CSI_VC0CFGR1_DT5EN_Pos)         /*!< 0x00000040 */
#define CSI_VC0CFGR1_DT5EN              CSI_VC0CFGR1_DT5EN_Msk                   /*!< Data type 5 enable */
#define CSI_VC0CFGR1_DT6EN_Pos          (7U)
#define CSI_VC0CFGR1_DT6EN_Msk          (0x1UL << CSI_VC0CFGR1_DT6EN_Pos)         /*!< 0x00000080 */
#define CSI_VC0CFGR1_DT6EN              CSI_VC0CFGR1_DT6EN_Msk                   /*!< Data type 6 enable */
#define CSI_VC0CFGR1_CDTFT_Pos          (8U)
#define CSI_VC0CFGR1_CDTFT_Msk          (0x1FUL << CSI_VC0CFGR1_CDTFT_Pos)        /*!< 0x00001F00 */
#define CSI_VC0CFGR1_CDTFT              CSI_VC0CFGR1_CDTFT_Msk                   /*!< Common format for all data types */
#define CSI_VC0CFGR1_DT0_Pos            (16U)
#define CSI_VC0CFGR1_DT0_Msk            (0x3FUL << CSI_VC0CFGR1_DT0_Pos)          /*!< 0x003F0000 */
#define CSI_VC0CFGR1_DT0                CSI_VC0CFGR1_DT0_Msk                     /*!< Data type 0 class selection for virtual channel x */
#define CSI_VC0CFGR1_DT0FT_Pos          (24U)
#define CSI_VC0CFGR1_DT0FT_Msk          (0x1FUL << CSI_VC0CFGR1_DT0FT_Pos)        /*!< 0x1F000000 */
#define CSI_VC0CFGR1_DT0FT              CSI_VC0CFGR1_DT0FT_Msk                   /*!< Data type 0 format */

/*****************  Bit definition for CSI_VC0CFGR2 register  *****************/
#define CSI_VC0CFGR2_DT1_Pos            (0U)
#define CSI_VC0CFGR2_DT1_Msk            (0x3FUL << CSI_VC0CFGR2_DT1_Pos)          /*!< 0x0000003F */
#define CSI_VC0CFGR2_DT1                CSI_VC0CFGR2_DT1_Msk                     /*!< Data type 1 class selection for virtual channel x */
#define CSI_VC0CFGR2_DT1FT_Pos          (8U)
#define CSI_VC0CFGR2_DT1FT_Msk          (0x1FUL << CSI_VC0CFGR2_DT1FT_Pos)        /*!< 0x00001F00 */
#define CSI_VC0CFGR2_DT1FT              CSI_VC0CFGR2_DT1FT_Msk                   /*!< Data type 1 format */
#define CSI_VC0CFGR2_DT2_Pos            (16U)
#define CSI_VC0CFGR2_DT2_Msk            (0x3FUL << CSI_VC0CFGR2_DT2_Pos)          /*!< 0x003F0000 */
#define CSI_VC0CFGR2_DT2                CSI_VC0CFGR2_DT2_Msk                     /*!< Data type 2 class selection for virtual channel x */
#define CSI_VC0CFGR2_DT2FT_Pos          (24U)
#define CSI_VC0CFGR2_DT2FT_Msk          (0x1FUL << CSI_VC0CFGR2_DT2FT_Pos)        /*!< 0x1F000000 */
#define CSI_VC0CFGR2_DT2FT              CSI_VC0CFGR2_DT2FT_Msk                   /*!< Data type 2 format */

/*****************  Bit definition for CSI_VC0CFGR3 register  *****************/
#define CSI_VC0CFGR3_DT3_Pos            (0U)
#define CSI_VC0CFGR3_DT3_Msk            (0x3FUL << CSI_VC0CFGR3_DT3_Pos)          /*!< 0x0000003F */
#define CSI_VC0CFGR3_DT3                CSI_VC0CFGR3_DT3_Msk                     /*!< Data type 3 class selection for virtual channel x */
#define CSI_VC0CFGR3_DT3FT_Pos          (8U)
#define CSI_VC0CFGR3_DT3FT_Msk          (0x1FUL << CSI_VC0CFGR3_DT3FT_Pos)        /*!< 0x00001F00 */
#define CSI_VC0CFGR3_DT3FT              CSI_VC0CFGR3_DT3FT_Msk                   /*!< Data type 3 format */
#define CSI_VC0CFGR3_DT4_Pos            (16U)
#define CSI_VC0CFGR3_DT4_Msk            (0x3FUL << CSI_VC0CFGR3_DT4_Pos)          /*!< 0x003F0000 */
#define CSI_VC0CFGR3_DT4                CSI_VC0CFGR3_DT4_Msk                     /*!< Data type 4 class selection for virtual channel x */
#define CSI_VC0CFGR3_DT4FT_Pos          (24U)
#define CSI_VC0CFGR3_DT4FT_Msk          (0x1FUL << CSI_VC0CFGR3_DT4FT_Pos)        /*!< 0x1F000000 */
#define CSI_VC0CFGR3_DT4FT              CSI_VC0CFGR3_DT4FT_Msk                   /*!< Data type 4 format */

