STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235axx_ca35.h
/***************  Bit definition for DCMIPP_P0HWCFGR register  ****************/
#define DCMIPP_P0HWCFGR_CPLA_Pos            (0U)
#define DCMIPP_P0HWCFGR_CPLA_Msk            (0x3UL << DCMIPP_P0HWCFGR_CPLA_Pos)              /*!< 0x00000003 */
#define DCMIPP_P0HWCFGR_CPLA                DCMIPP_P0HWCFGR_CPLA_Msk                        /*!< Capability for planar buffers */
#define DCMIPP_P0HWCFGR_CDS_Pos             (2U)
#define DCMIPP_P0HWCFGR_CDS_Msk             (0x1UL << DCMIPP_P0HWCFGR_CDS_Pos)               /*!< 0x00000004 */
#define DCMIPP_P0HWCFGR_CDS                 DCMIPP_P0HWCFGR_CDS_Msk                         /*!< Capability for downsize filter */
#define DCMIPP_P0HWCFGR_DBM_Pos             (3U)
#define DCMIPP_P0HWCFGR_DBM_Msk             (0x1UL << DCMIPP_P0HWCFGR_DBM_Pos)               /*!< 0x00000008 */
#define DCMIPP_P0HWCFGR_DBM                 DCMIPP_P0HWCFGR_DBM_Msk                         /*!< Double buffer mode */
#define DCMIPP_P0HWCFGR_CRB_Pos             (4U)
#define DCMIPP_P0HWCFGR_CRB_Msk             (0x3UL << DCMIPP_P0HWCFGR_CRB_Pos)               /*!< 0x00000030 */
#define DCMIPP_P0HWCFGR_CRB                 DCMIPP_P0HWCFGR_CRB_Msk                         /*!< Capability for demosaicing */
#define DCMIPP_P0HWCFGR_CGM_Pos             (6U)
#define DCMIPP_P0HWCFGR_CGM_Msk             (0x3UL << DCMIPP_P0HWCFGR_CGM_Pos)               /*!< 0x000000C0 */
#define DCMIPP_P0HWCFGR_CGM                 DCMIPP_P0HWCFGR_CGM_Msk                         /*!< Capability for gamma conversions */
#define DCMIPP_P0HWCFGR_CROI_Pos            (8U)
#define DCMIPP_P0HWCFGR_CROI_Msk            (0xFUL << DCMIPP_P0HWCFGR_CROI_Pos)              /*!< 0x00000F00 */
#define DCMIPP_P0HWCFGR_CROI                DCMIPP_P0HWCFGR_CROI_Msk                        /*!< Capability for ROI: defines the number of ROI in the pipe */
#define DCMIPP_P0HWCFGR_CVP_Pos             (13U)
#define DCMIPP_P0HWCFGR_CVP_Msk             (0x1UL << DCMIPP_P0HWCFGR_CVP_Pos)               /*!< 0x00002000 */
#define DCMIPP_P0HWCFGR_CVP                 DCMIPP_P0HWCFGR_CVP_Msk                         /*!< Capability for virtual pipeline virtualization */

/****************  Bit definition for DCMIPP_P0FSCR register  *****************/
#define DCMIPP_P0FSCR_DTIDA_Pos             (0U)
#define DCMIPP_P0FSCR_DTIDA_Msk             (0x3FUL << DCMIPP_P0FSCR_DTIDA_Pos)              /*!< 0x0000003F */
#define DCMIPP_P0FSCR_DTIDA                 DCMIPP_P0FSCR_DTIDA_Msk                         /*!< Data type selection ID A */
#define DCMIPP_P0FSCR_DTIDB_Pos             (8U)
#define DCMIPP_P0FSCR_DTIDB_Msk             (0x3FUL << DCMIPP_P0FSCR_DTIDB_Pos)              /*!< 0x00003F00 */
#define DCMIPP_P0FSCR_DTIDB                 DCMIPP_P0FSCR_DTIDB_Msk                         /*!< Data type selection ID B */
#define DCMIPP_P0FSCR_DTMODE_Pos            (16U)
#define DCMIPP_P0FSCR_DTMODE_Msk            (0x3UL << DCMIPP_P0FSCR_DTMODE_Pos)              /*!< 0x00030000 */
#define DCMIPP_P0FSCR_DTMODE                DCMIPP_P0FSCR_DTMODE_Msk                        /*!< Flow selection mode */
#define DCMIPP_P0FSCR_VC_Pos                (19U)
#define DCMIPP_P0FSCR_VC_Msk                (0x3UL << DCMIPP_P0FSCR_VC_Pos)                  /*!< 0x00180000 */
#define DCMIPP_P0FSCR_VC                    DCMIPP_P0FSCR_VC_Msk                            /*!< Flow selection mode */
#define DCMIPP_P0FSCR_PIPEN_Pos             (31U)
#define DCMIPP_P0FSCR_PIPEN_Msk             (0x1UL << DCMIPP_P0FSCR_PIPEN_Pos)               /*!< 0x80000000 */
#define DCMIPP_P0FSCR_PIPEN                 DCMIPP_P0FSCR_PIPEN_Msk                         /*!< Activation of PipeN */

/****************  Bit definition for DCMIPP_P0FCTCR register  ****************/
#define DCMIPP_P0FCTCR_FRATE_Pos            (0U)
#define DCMIPP_P0FCTCR_FRATE_Msk            (0x3UL << DCMIPP_P0FCTCR_FRATE_Pos)              /*!< 0x00000003 */
#define DCMIPP_P0FCTCR_FRATE                DCMIPP_P0FCTCR_FRATE_Msk                        /*!< Frame capture rate control */
#define DCMIPP_P0FCTCR_CPTMODE_Pos          (2U)
#define DCMIPP_P0FCTCR_CPTMODE_Msk          (0x1UL << DCMIPP_P0FCTCR_CPTMODE_Pos)            /*!< 0x00000004 */
#define DCMIPP_P0FCTCR_CPTMODE              DCMIPP_P0FCTCR_CPTMODE_Msk                      /*!< Capture mode */
#define DCMIPP_P0FCTCR_CPTREQ_Pos           (3U)
#define DCMIPP_P0FCTCR_CPTREQ_Msk           (0x1UL << DCMIPP_P0FCTCR_CPTREQ_Pos)             /*!< 0x00000008 */
#define DCMIPP_P0FCTCR_CPTREQ               DCMIPP_P0FCTCR_CPTREQ_Msk                       /*!< Capture requested */

/****************  Bit definition for DCMIPP_P0SCSTR register  ****************/
#define DCMIPP_P0SCSTR_HSTART_Pos           (0U)
#define DCMIPP_P0SCSTR_HSTART_Msk           (0xFFFUL << DCMIPP_P0SCSTR_HSTART_Pos)           /*!< 0x00000FFF */
#define DCMIPP_P0SCSTR_HSTART               DCMIPP_P0SCSTR_HSTART_Msk                       /*!< Horizontal start, from 0 to 4094 words wide */
#define DCMIPP_P0SCSTR_VSTART_Pos           (16U)
#define DCMIPP_P0SCSTR_VSTART_Msk           (0xFFFUL << DCMIPP_P0SCSTR_VSTART_Pos)           /*!< 0x0FFF0000 */
#define DCMIPP_P0SCSTR_VSTART               DCMIPP_P0SCSTR_VSTART_Msk                       /*!< Vertical start, from 0 to 4094 pixels high */

/****************  Bit definition for DCMIPP_P0SCSZR register  ****************/
#define DCMIPP_P0SCSZR_HSIZE_Pos            (0U)
#define DCMIPP_P0SCSZR_HSIZE_Msk            (0xFFFUL << DCMIPP_P0SCSZR_HSIZE_Pos)            /*!< 0x00000FFF */
#define DCMIPP_P0SCSZR_HSIZE                DCMIPP_P0SCSZR_HSIZE_Msk                        /*!< Horizontal size, from 0 to 4094 word wide (data 32-bit) */
#define DCMIPP_P0SCSZR_VSIZE_Pos            (16U)
#define DCMIPP_P0SCSZR_VSIZE_Msk            (0xFFFUL << DCMIPP_P0SCSZR_VSIZE_Pos)            /*!< 0x0FFF0000 */
#define DCMIPP_P0SCSZR_VSIZE                DCMIPP_P0SCSZR_VSIZE_Msk                        /*!< Vertical size, from 0 to 4094 pixels high */
#define DCMIPP_P0SCSZR_POSNEG_Pos           (30U)
#define DCMIPP_P0SCSZR_POSNEG_Msk           (0x1UL << DCMIPP_P0SCSZR_POSNEG_Pos)             /*!< 0x40000000 */
#define DCMIPP_P0SCSZR_POSNEG               DCMIPP_P0SCSZR_POSNEG_Msk                       /*!< This bit is set and cleared by software */
#define DCMIPP_P0SCSZR_ENABLE_Pos           (31U)
#define DCMIPP_P0SCSZR_ENABLE_Msk           (0x1UL << DCMIPP_P0SCSZR_ENABLE_Pos)             /*!< 0x80000000 */
#define DCMIPP_P0SCSZR_ENABLE               DCMIPP_P0SCSZR_ENABLE_Msk                       /*!< This bit is set and cleared by software */

/***************  Bit definition for DCMIPP_P0DCCNTR register  ****************/
#define DCMIPP_P0DCCNTR_CNT_Pos             (0U)
#define DCMIPP_P0DCCNTR_CNT_Msk             (0x3FFFFFFUL << DCMIPP_P0DCCNTR_CNT_Pos)         /*!< 0x03FFFFFF */
#define DCMIPP_P0DCCNTR_CNT                 DCMIPP_P0DCCNTR_CNT_Msk                         /*!< Number of data dumped during the frame */

