STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp235axx_ca35.h
/***************  Bit definition for SYSCFG_PCIEPRGCR register  ***************/
#define SYSCFG_PCIEPRGCR_PRG_EN_Pos                                        (0U)
#define SYSCFG_PCIEPRGCR_PRG_EN_Msk                                        (0x1UL << SYSCFG_PCIEPRGCR_PRG_EN_Pos)                                          /*!< 0x00000001 */
#define SYSCFG_PCIEPRGCR_PRG_EN                                            SYSCFG_PCIEPRGCR_PRG_EN_Msk                                                    /*!< - 0: the internal 100 MHz clock PCIe Reference Generator is disabled */
#define SYSCFG_PCIEPRGCR_PRG_IMP_CTRL_Pos                                  (1U)
#define SYSCFG_PCIEPRGCR_PRG_IMP_CTRL_Msk                                  (0x1FUL << SYSCFG_PCIEPRGCR_PRG_IMP_CTRL_Pos)                                   /*!< 0x0000003E */
#define SYSCFG_PCIEPRGCR_PRG_IMP_CTRL                                      SYSCFG_PCIEPRGCR_PRG_IMP_CTRL_Msk                                              /*!< Control of the impedance of the 100 MHz differential output buffer */

/****************  Bit definition for SYSCFG_PCIESR1 register  ****************/
#define SYSCFG_PCIESR1_PM_DSTATE_Pos                                       (0U)
#define SYSCFG_PCIESR1_PM_DSTATE_Msk                                       (0x7UL << SYSCFG_PCIESR1_PM_DSTATE_Pos)                                         /*!< 0x00000007 */
#define SYSCFG_PCIESR1_PM_DSTATE                                           SYSCFG_PCIESR1_PM_DSTATE_Msk                                                   /*!< Power Management D-state */
#define SYSCFG_PCIESR1_SMLH_LINK_UP_Pos                                    (3U)
#define SYSCFG_PCIESR1_SMLH_LINK_UP_Msk                                    (0x1UL << SYSCFG_PCIESR1_SMLH_LINK_UP_Pos)                                      /*!< 0x00000008 */
#define SYSCFG_PCIESR1_SMLH_LINK_UP                                        SYSCFG_PCIESR1_SMLH_LINK_UP_Msk                                                /*!< PHY link is up */
#define SYSCFG_PCIESR1_CFG_HW_AUTO_SP_DIS_Pos                              (4U)
#define SYSCFG_PCIESR1_CFG_HW_AUTO_SP_DIS_Msk                              (0x1UL << SYSCFG_PCIESR1_CFG_HW_AUTO_SP_DIS_Pos)                                /*!< 0x00000010 */
#define SYSCFG_PCIESR1_CFG_HW_AUTO_SP_DIS                                  SYSCFG_PCIESR1_CFG_HW_AUTO_SP_DIS_Msk                                          /*!< H/W autonomous speed disable */
#define SYSCFG_PCIESR1_RDLH_LINK_UP_Pos                                    (5U)
#define SYSCFG_PCIESR1_RDLH_LINK_UP_Msk                                    (0x1UL << SYSCFG_PCIESR1_RDLH_LINK_UP_Pos)                                      /*!< 0x00000020 */
#define SYSCFG_PCIESR1_RDLH_LINK_UP                                        SYSCFG_PCIESR1_RDLH_LINK_UP_Msk                                                /*!< Data link layer is up */
#define SYSCFG_PCIESR1_MSI_CTRL_INT_Pos                                    (6U)
#define SYSCFG_PCIESR1_MSI_CTRL_INT_Msk                                    (0x1UL << SYSCFG_PCIESR1_MSI_CTRL_INT_Pos)                                      /*!< 0x00000040 */
#define SYSCFG_PCIESR1_MSI_CTRL_INT                                        SYSCFG_PCIESR1_MSI_CTRL_INT_Msk                                                /*!< pcie_1_msi_ctrl_int interrupt */
#define SYSCFG_PCIESR1_LINK_RST_INT_Pos                                    (7U)
#define SYSCFG_PCIESR1_LINK_RST_INT_Msk                                    (0x1UL << SYSCFG_PCIESR1_LINK_RST_INT_Pos)                                      /*!< 0x00000080 */
#define SYSCFG_PCIESR1_LINK_RST_INT                                        SYSCFG_PCIESR1_LINK_RST_INT_Msk                                                /*!< pcie_1_link_rst_int interrupt */
#define SYSCFG_PCIESR1_INTD_INTERRUPT_Pos                                  (8U)
#define SYSCFG_PCIESR1_INTD_INTERRUPT_Msk                                  (0x1UL << SYSCFG_PCIESR1_INTD_INTERRUPT_Pos)                                    /*!< 0x00000100 */
#define SYSCFG_PCIESR1_INTD_INTERRUPT                                      SYSCFG_PCIESR1_INTD_INTERRUPT_Msk                                              /*!< pcie_1_intd interrupt */
#define SYSCFG_PCIESR1_INTC_INTERRUPT_Pos                                  (9U)
#define SYSCFG_PCIESR1_INTC_INTERRUPT_Msk                                  (0x1UL << SYSCFG_PCIESR1_INTC_INTERRUPT_Pos)                                    /*!< 0x00000200 */
#define SYSCFG_PCIESR1_INTC_INTERRUPT                                      SYSCFG_PCIESR1_INTC_INTERRUPT_Msk                                              /*!< pcie_1_intc interrupt */
#define SYSCFG_PCIESR1_INTB_INTERRUPT_Pos                                  (10U)
#define SYSCFG_PCIESR1_INTB_INTERRUPT_Msk                                  (0x1UL << SYSCFG_PCIESR1_INTB_INTERRUPT_Pos)                                    /*!< 0x00000400 */
#define SYSCFG_PCIESR1_INTB_INTERRUPT                                      SYSCFG_PCIESR1_INTB_INTERRUPT_Msk                                              /*!< pcie_1_intb interrupt */
#define SYSCFG_PCIESR1_INTA_INTERRUPT_Pos                                  (11U)
#define SYSCFG_PCIESR1_INTA_INTERRUPT_Msk                                  (0x1UL << SYSCFG_PCIESR1_INTA_INTERRUPT_Pos)                                    /*!< 0x00000800 */
#define SYSCFG_PCIESR1_INTA_INTERRUPT                                      SYSCFG_PCIESR1_INTA_INTERRUPT_Msk                                              /*!< pcie_1_inta interrupt */
#define SYSCFG_PCIESR1_CFG_PME_INT_Pos                                     (12U)
#define SYSCFG_PCIESR1_CFG_PME_INT_Msk                                     (0x1UL << SYSCFG_PCIESR1_CFG_PME_INT_Pos)                                       /*!< 0x00001000 */
#define SYSCFG_PCIESR1_CFG_PME_INT                                         SYSCFG_PCIESR1_CFG_PME_INT_Msk                                                 /*!< pcie_1_cfg_pme interrupt */
#define SYSCFG_PCIESR1_CFG_AER_RC_ERR_INT_Pos                              (13U)
#define SYSCFG_PCIESR1_CFG_AER_RC_ERR_INT_Msk                              (0x1UL << SYSCFG_PCIESR1_CFG_AER_RC_ERR_INT_Pos)                                /*!< 0x00002000 */
#define SYSCFG_PCIESR1_CFG_AER_RC_ERR_INT                                  SYSCFG_PCIESR1_CFG_AER_RC_ERR_INT_Msk                                          /*!< pcie_1_cfg_aer_rc_err interrupt */
#define SYSCFG_PCIESR1_RADM_Q_NOT_EMPTY_Pos                                (14U)
#define SYSCFG_PCIESR1_RADM_Q_NOT_EMPTY_Msk                                (0x1UL << SYSCFG_PCIESR1_RADM_Q_NOT_EMPTY_Pos)                                  /*!< 0x00004000 */
#define SYSCFG_PCIESR1_RADM_Q_NOT_EMPTY                                    SYSCFG_PCIESR1_RADM_Q_NOT_EMPTY_Msk                                            /*!< Level high indicates that the receive queues contain TLP header/data */
#define SYSCFG_PCIESR1_RADM_QOVERFLOW_Pos                                  (15U)
#define SYSCFG_PCIESR1_RADM_QOVERFLOW_Msk                                  (0x1UL << SYSCFG_PCIESR1_RADM_QOVERFLOW_Pos)                                    /*!< 0x00008000 */
#define SYSCFG_PCIESR1_RADM_QOVERFLOW                                      SYSCFG_PCIESR1_RADM_QOVERFLOW_Msk                                              /*!< Level high indicates that one or more of the P/NP/CPL receive queues has overflowed */
#define SYSCFG_PCIESR1_PTM_REQ_REPLAY_TX_Pos                               (16U)
#define SYSCFG_PCIESR1_PTM_REQ_REPLAY_TX_Msk                               (0x1UL << SYSCFG_PCIESR1_PTM_REQ_REPLAY_TX_Pos)                                 /*!< 0x00010000 */
#define SYSCFG_PCIESR1_PTM_REQ_REPLAY_TX                                   SYSCFG_PCIESR1_PTM_REQ_REPLAY_TX_Msk                                           /*!< PTM Requester detected a TLP replay being sent when ResponseD message in use, and one of the follow */
#define SYSCFG_PCIESR1_PTM_REQ_DUP_RX_Pos                                  (17U)
#define SYSCFG_PCIESR1_PTM_REQ_DUP_RX_Msk                                  (0x1UL << SYSCFG_PCIESR1_PTM_REQ_DUP_RX_Pos)                                    /*!< 0x00020000 */
#define SYSCFG_PCIESR1_PTM_REQ_DUP_RX                                      SYSCFG_PCIESR1_PTM_REQ_DUP_RX_Msk                                              /*!< PTM Requester Duplicate TLP Received, when PTM Requester is in the process of updating PTM local cl */
#define SYSCFG_PCIESR1_PTM_REQ_RESPONSE_TIMEOUT_Pos                        (18U)
#define SYSCFG_PCIESR1_PTM_REQ_RESPONSE_TIMEOUT_Msk                        (0x1UL << SYSCFG_PCIESR1_PTM_REQ_RESPONSE_TIMEOUT_Pos)                          /*!< 0x00040000 */
#define SYSCFG_PCIESR1_PTM_REQ_RESPONSE_TIMEOUT                            SYSCFG_PCIESR1_PTM_REQ_RESPONSE_TIMEOUT_Msk                                    /*!< PTM Requester Response Timeout */
#define SYSCFG_PCIESR1_PTM_CLOCK_UPDATED_Pos                               (19U)
#define SYSCFG_PCIESR1_PTM_CLOCK_UPDATED_Msk                               (0x1UL << SYSCFG_PCIESR1_PTM_CLOCK_UPDATED_Pos)                                 /*!< 0x00080000 */
#define SYSCFG_PCIESR1_PTM_CLOCK_UPDATED                                   SYSCFG_PCIESR1_PTM_CLOCK_UPDATED_Msk                                           /*!< Controller has updated the Local Clock */
#define SYSCFG_PCIESR1_PTM_UPDATING_Pos                                    (20U)
#define SYSCFG_PCIESR1_PTM_UPDATING_Msk                                    (0x1UL << SYSCFG_PCIESR1_PTM_UPDATING_Pos)                                      /*!< 0x00100000 */
#define SYSCFG_PCIESR1_PTM_UPDATING                                        SYSCFG_PCIESR1_PTM_UPDATING_Msk                                                /*!< PTM update is in progress */
#define SYSCFG_PCIESR1_PTM_RESPONDER_RDY_TO_VALIDATE_Pos                   (21U)
#define SYSCFG_PCIESR1_PTM_RESPONDER_RDY_TO_VALIDATE_Msk                   (0x1UL << SYSCFG_PCIESR1_PTM_RESPONDER_RDY_TO_VALIDATE_Pos)                     /*!< 0x00200000 */
#define SYSCFG_PCIESR1_PTM_RESPONDER_RDY_TO_VALIDATE                       SYSCFG_PCIESR1_PTM_RESPONDER_RDY_TO_VALIDATE_Msk                               /*!< Application software can re-validate the context, because it was invalidated */

/****************  Bit definition for SYSCFG_PCIESR2 register  ****************/
#define SYSCFG_PCIESR2_CFG_PME_MSI_INT_STS_Pos                             (0U)
#define SYSCFG_PCIESR2_CFG_PME_MSI_INT_STS_Msk                             (0x1UL << SYSCFG_PCIESR2_CFG_PME_MSI_INT_STS_Pos)                               /*!< 0x00000001 */
#define SYSCFG_PCIESR2_CFG_PME_MSI_INT_STS                                 SYSCFG_PCIESR2_CFG_PME_MSI_INT_STS_Msk                                         /*!< Indicates status of PCIe cfg_pme_msi interrupt */
#define SYSCFG_PCIESR2_CFG_AER_RC_ERR_MSI_INT_STS_Pos                      (1U)
#define SYSCFG_PCIESR2_CFG_AER_RC_ERR_MSI_INT_STS_Msk                      (0x1UL << SYSCFG_PCIESR2_CFG_AER_RC_ERR_MSI_INT_STS_Pos)                        /*!< 0x00000002 */
#define SYSCFG_PCIESR2_CFG_AER_RC_ERR_MSI_INT_STS                          SYSCFG_PCIESR2_CFG_AER_RC_ERR_MSI_INT_STS_Msk                                  /*!< Indicates status of PCIe cfg_aer_rc_err_msi interrupt */
#define SYSCFG_PCIESR2_CFG_SYS_ERR_RC_INT_STS_Pos                          (2U)
#define SYSCFG_PCIESR2_CFG_SYS_ERR_RC_INT_STS_Msk                          (0x1UL << SYSCFG_PCIESR2_CFG_SYS_ERR_RC_INT_STS_Pos)                            /*!< 0x00000004 */
#define SYSCFG_PCIESR2_CFG_SYS_ERR_RC_INT_STS                              SYSCFG_PCIESR2_CFG_SYS_ERR_RC_INT_STS_Msk                                      /*!< Indicates status of PCIe cfg_sys_err_rc interrupt */

